In [54]:
import numpy as np
from datascience import *

# Building Tables

In [55]:
session_logs = Table.read_table('(Enc)Data - Coded_SessionLogs.csv')
session_logs

Unnamed: 0 | "Name" | Services                         | Course                               | SignInTime          | SignOutTime         | Period   | Tutor
0          | Jojo   | No Sessions                      | nan                                  | nan                 | nan                 | nan      | nan
1          | Shayla | In-person Tutoring (STEM Center) | [MATH-252]Calcu/Analytic Geometry II | 2022-10-07 09:05:00 | 2022-10-07 09:16:00 | 00:11:00 | Thiri Wai Wai
2          | Shayla | In-person Tutoring (STEM Center) | [MATH-252]Calcu/Analytic Geometry II | 2022-10-05 11:17:00 | 2022-10-05 11:59:00 | 00:42:00 | Hilary Lin
3          | Shayla | Space to Study (STEM Center)     | nan                                  | 2022-09-28 09:03:00 | 2022-09-28 10:06:00 | 01:03:00 | nan
4          | Shayla | In-person Tutoring (STEM Center) | [MATH-252]Calcu/Analytic Geometry II | 2022-09-21 09:50:00 | 2022-09-21 10:05:00 | 00:15:00 | Thiri Wai Wai
5          | Shayla | Space to Study (STEM Center)     | nan                                  | 2022-09-19 14:11:00 | 2022-09-19 17:41:00 | 03:30:00 | nan
6          | Shayla | Space to Study (STEM Center)     | nan                                  | 2022-09-19 09:08:00 | 2022-09-19 12:03:00 | 02:55:00 | nan
7          | Shayla | Space to Study (STEM Center)     | nan                                  | 2022-09-12 09:13:00 | 2022-09-12 09:51:00 | 00:38:00 | nan
8          | Shayla | Space to Study (STEM Center)     | nan                                  | 2022-09-07 15:48:00 | 2022-09-07 17:26:00 | 01:38:00 | nan
9          | Shayla | Space to Study (STEM Center)     | nan                                  | 2022-09-07 11:43:00 | 2022-09-07 11:43:00 | 00:00:00 | nan
... (9691 rows omitted)

In [56]:
subscription = make_array('Netflix','HBO Max','Hulu','Crunchyroll','Spotify','DoorDash','AmazonPrime','Discord Nitro')
subscription

array(['Netflix', 'HBO Max', 'Hulu', 'Crunchyroll', 'Spotify', 'DoorDash',
       'AmazonPrime', 'Discord Nitro'],
      dtype='<U13')

In [57]:
#Amazon and Discord are annual fees
month_fee_cost = make_array(19.99,14.99,9.99,9.99,9.99,9.99,(130/12),(169.97/12))
month_fee_cost

array([ 19.99      ,  14.99      ,   9.99      ,   9.99      ,
         9.99      ,   9.99      ,  10.83333333,  14.16416667])

In [58]:
bryans_monthly_subscriptions = Table().with_columns('Subscription',subscription,'$$ per month',month_fee_cost)
bryans_monthly_subscriptions

Subscription  | $$ per month
Netflix       | 19.99
HBO Max       | 14.99
Hulu          | 9.99
Crunchyroll   | 9.99
Spotify       | 9.99
DoorDash      | 9.99
AmazonPrime   | 10.8333
Discord Nitro | 14.1642

In [59]:
#annual_cost = bryans_monthly_subscriptions.column('$$ per month') * 12
#OR, below
annual_cost = month_fee_cost *12 
annual_cost

array([ 239.88,  179.88,  119.88,  119.88,  119.88,  119.88,  130.  ,
        169.97])

In [60]:
new_table = bryans_monthly_subscriptions.with_column('$$ each year',annual_cost)#.drop('$$ per month')
new_table

Subscription  | $$ per month | $$ each year
Netflix       | 19.99        | 239.88
HBO Max       | 14.99        | 179.88
Hulu          | 9.99         | 119.88
Crunchyroll   | 9.99         | 119.88
Spotify       | 9.99         | 119.88
DoorDash      | 9.99         | 119.88
AmazonPrime   | 10.8333      | 130
Discord Nitro | 14.1642      | 169.97

In [61]:
sum(annual_cost)

1199.25

In [62]:
new_new = new_table.take(np.arange(4))

In [63]:
#since new_table.take() was not assigned to a variable (old or new) the result of the .take() method was not saved
new_table

Subscription  | $$ per month | $$ each year
Netflix       | 19.99        | 239.88
HBO Max       | 14.99        | 179.88
Hulu          | 9.99         | 119.88
Crunchyroll   | 9.99         | 119.88
Spotify       | 9.99         | 119.88
DoorDash      | 9.99         | 119.88
AmazonPrime   | 10.8333      | 130
Discord Nitro | 14.1642      | 169.97

In [64]:
new_new

Subscription | $$ per month | $$ each year
Netflix      | 19.99        | 239.88
HBO Max      | 14.99        | 179.88
Hulu         | 9.99         | 119.88
Crunchyroll  | 9.99         | 119.88

# Order of Operations with tables

In [65]:
movies = Table.read_table('Movies - Cleaned.csv')
movies.show(5)

## Question: How many movies in this data set were sequels?

In [66]:
movies.where("Order",are.above(10))

index | Title                   | Release Date | Year | Description | URL                                   | IMDb Rating | Runtime (mins) | Genres                              | Num Votes | Directors          | Movie Series | Order
258   | Halloween               | 08-09-2018   | 2018 | nan         | https://www.imdb.com/title/tt1502407/ | 6.6         | 106            | Horror, Thriller                    | 109901    | David Gordon Green | Halloween    | 11
571   | Star Trek: Nemesis      | 09-12-2002   | 2002 | nan         | https://www.imdb.com/title/tt0253754/ | 6.4         | 116            | Action, Adventure, Sci-Fi, Thriller | 71979     | Stuart Baird       | Star Trek    | 11
572   | Star Trek               | 06-04-2009   | 2009 | nan         | https://www.imdb.com/title/tt0796366/ | 7.9         | 127            | Action, Adventure, Sci-Fi           | 569573    | J.J. Abrams        | Star Trek    | 12
573   | Star Trek Into Darkness | 02-05-2013   | 2013 | nan         | https://www.imdb.com/title/tt1408101/ | 7.7         | 132            | Action, Adventure, Sci-Fi           | 456702    | J.J. Abrams        | Star Trek    | 13
574   | Star Trek Beyond        | 20-07-2016   | 2016 | nan         | https://www.imdb.com/title/tt2660888/ | 7.1         | 122            | Action, Adventure, Sci-Fi, Thriller | 221100    | Justin Lin         | Star Trek    | 14

In [67]:
#movies.column("Order")>1

## How many movies had sequels that were rated higher than the original? On average, do they perform better, or worse?

In [68]:
original = movies.where("Order",1)
sequels = movies.where("Order",are.above(1))

np.average(original.where("IMDb Rating",are.above(0)).column("IMDb Rating")) > np.average(sequels.where("IMDb Rating",are.above(0)).column("IMDb Rating"))

True

In [69]:
movies.show(3)

## Challenge!

Let's suppose that you had the movies data stored in a USB Drive. You know how computers almost always scream at you for yanking out the USB Drive before you 'eject' it? Usually, nothing happens...

But in this situation, let's say it does and you get the following table below:

In [70]:
challenge_movies = movies.drop('Order','index','Description','URL','Num Votes','Directors','Release Date').sample(movies.num_rows)
challenge_movies

Title                                        | Year | IMDb Rating | Runtime (mins) | Genres                                      | Movie Series
I Know What You Did Last Summer              | 1997 | 5.7         | 101            | Horror, Mystery                             | I Know What You Did Last Summer
Hellbound: Hellraiser II                     | 1988 | 6.5         | 97             | Horror, Thriller                            | Hellbound
Fletch Lives                                 | 1989 | 6.1         | 95             | Comedy, Crime, Mystery                      | Fletch
Exorcist: The Beginning                      | 2004 | 5.2         | 114            | Horror, Mystery, Thriller                   | The Exorcist
In the Name of the King: The Last Mission    | 2014 | 3.1         | 86             | Action, Adventure, Fantasy, Thriller        | In the Name of the King
The Lawnmower Man                            | 1992 | 5.5         | 108            | Horror, Sci-Fi                              | Lawnmower Man
Final Destination 2                          | 2003 | 6.2         | 90             | Horror, Thriller                            | Final Destination
Harry Potter and the Prisoner of Azkaban     | 2004 | 7.9         | 142            | Adventure, Family, Fantasy, Mystery         | Harry Potter
Star Wars: Episode II - Attack of the Clones | 2002 | 6.5         | 142            | Action, Adventure, Fantasy, Sci-Fi          | Star Wars
Harry Potter and the Half-Blood Prince       | 2009 | 7.6         | 153            | Action, Adventure, Family, Fantasy, Mystery | Harry Potter
... (856 rows omitted)

### Question: How can we use our methods to re-order our rows back to their original state? We unfortunately lost the columns for good... :(

In [72]:
challenge_movies.sort("Movie Series").sort("Year")

Title                          | Year | IMDb Rating | Runtime (mins) | Genres                    | Movie Series
Bambi                          | 1942 | 7.3         | 70             | Animation, Drama, Family  | Bambi
Cat People                     | 1942 | 7.3         | 73             | Fantasy, Horror, Thriller | Cat People
The Curse of the Cat People    | 1944 | 6.9         | 70             | Drama, Horror, Mystery    | Cat People
The Curse of the Cat People    | 1944 | 6.9         | 70             | Drama, Horror, Mystery    | Cat People
The Hustler                    | 1961 | 8           | 134            | Drama, Sport              | The Hustler
Planet of the Apes             | 1968 | 8           | 112            | Adventure, Sci-Fi         | Planet of the Apes
Beneath the Planet of the Apes | 1970 | 6.1         | 95             | Action, Adventure, Sci-Fi | Beneath the Planet of the Apes
Beneath the Planet of the Apes | 1970 | 6.1         | 95             | Action, Adventure, Sci-Fi | Beneath the Planet of the Apes
Dirty Harry                    | 1971 | 7.7         | 102            | Action, Crime, Thriller   | Dirty Harry
Dirty Harry                    | 1971 | 7.7         | 102            | Action, Crime, Thriller   | Dirty Harry
... (856 rows omitted)

# From Homework02

**Question 3.** The `faithful_with_eruption_nums` table contains two columns: `eruption_number`, which represents the number of that eruption, and `waiting`, which represents the time spent waiting after that eruption. For example, take the first two rows of the table:

| eruption number | waiting |
|-----------------|---------|
| 1               | 79      |
| 2               | 54      |

We can read this as follows: after the first eruption, we waited 79 minutes for the second eruption. Then, after the second eruption, we waited 54 minutes for the third eruption.

Suppose Oscar and Wendy started watching Old Faithful at the start of the first eruption. Assume that they watch until the end of the tenth eruption. For some of that time they will be watching eruptions, and for the rest of the time they will be waiting for Old Faithful to erupt. How many minutes will they spend waiting for eruptions? **(4 Points)**

*Hint #1:* One way to approach this problem is to use the `take` or `where` method on the table `faithful_with_eruption_nums`. 

*Hint #2:* `first_nine_waiting_times` must be an array.

<!--
BEGIN QUESTION
name: q4_3
points:
 - 0
 - 4
-->

In [79]:
faithful = Table.read_table('old_faithful.csv').drop("eruptions")
faithful_with_eruption_nums = faithful.with_column("eruption number", np.arange(faithful.num_rows) + 1).select(1, 0)

faithful_with_eruption_nums.show(10)


first_nine_waiting_times = faithful_with_eruption_nums.column("waiting")[:9]
total_waiting_time_until_tenth = sum(first_nine_waiting_times)
total_waiting_time_until_tenth

633

#